# CentralModelVersionArchivedException Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CentralModelVersionArchivedException Properties
CentralModelVersionArchivedException Class See Also
---
The CentralModelVersionArchivedException type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Data | Gets a collection of key/value pairs that provide additional user-defined information about the exception. (Inherited from Exception.) |
| FunctionId | The information of the function throwing the exception. (Inherited from ApplicationException.) |
| HelpLink | Gets or sets a link to the help file associated with this exception. (Inherited from Exception.) |
| HResult | Gets or sets HRESULT, a coded numerical value that is assigned to a specific exception. (Inherited from Exception.) |
| InnerException | Gets the Exception instance that caused the current exception. (Inherited from Exception.) |
| Message | Gets a message that describes the current exception. (Inherited from Exception.) |
| Source | Gets or sets the name of the application or the object that causes the error. (Inherited from Exception.) |
| StackTrace | Gets a string representation of the immediate frames on the call stack. (Inherited from Exception.) |
| TargetSite | Gets the method that throws the current exception. (Inherited from Exception.) |

# See Also
CentralModelVersionArchivedException Class
Autodesk.Revit.Exceptions Namespace